{"user_id": 1, "recommendation": "Hello. Based on your profile, you have a unique combination of skin and hair needs. Your outdoor lifestyle significantly impacts your skin's hydration levels and eye area, while your wavy hair requires specific structural support to manage frizz and reduce shedding.\n\nAs your Dermatologist and Hair Stylist, here is your personalized analysis and regimen.\n\n---\n\n### 1. Recommended Cosmetic Products\n\n**For Skin:**\n*   **Gentle Hydrating Cleanser:** Look for a non-foaming or low-foam cleanser containing **Ceramides** or **Glycerin**. This balances your combination skin without stripping the dry areas.\n*   **Targeted Eye Cream:** Seek formulas with **Vitamin C** (to brighten), **Vitamin K**, or **Caffeine** (to constrict vessels and reduce the appearance of dark circles).\n*   **Broad-Spectrum Sunscreen (SPF 50+):** Essential for your outdoor lifestyle. Look for a \"Fluid\" or \"Gel-cream\" texture that won't feel greasy on your medium-oil areas but provides a barrier for the moderate dryness.\n*   **Hyaluronic Acid Serum:** Apply this to damp skin to address the moderate dryness without adding heavy oils.\n\n**For Hair:**\n*   **Sulfate-Free Smoothing Shampoo:** Sulfates strip natural oils, which causes wavy hair to frizz.\n*   **Leave-In Conditioner:** A lightweight cream or milk to provide a moisture barrier against humidity.\n*   **Scalp Revitalizing Serum:** Look for ingredients like **Redensyl**, **Procapil**, or **Rosemary Oil** to address medium hair fall by stimulating the follicles.\n*   **Anti-Frizz Serum/Oil:** A light **Argan or Marula oil** to seal the hair cuticle after styling.\n\n---\n\n### 2. Safe Home Remedies\n\n**For Skin (Dark Circles & Dryness):**\n*   **Cold Green Tea Compresses:** Place chilled, used green tea bags over your eyes for 10 minutes. The caffeine and antioxidants help with dark circles and puffiness.\n*   **Honey & Yogurt Mask:** Mix 1 tbsp of honey with 1 tbsp of plain yogurt. Apply for 15 minutes to hydrate dry patches and gently brighten the skin tone with natural lactic acid.\n\n**For Hair (Frizz & Hair Fall):**\n*   **Aloe Vera Scalp Treatment:** Apply fresh aloe vera gel to the scalp 30 minutes before washing. It balances the scalp and strengthens hair strands.\n*   **Flaxseed Gel:** Boil flaxseeds in water to create a natural gel. This provides excellent definition for wavy hair and eliminates frizz without harsh chemicals.\n\n---\n\n### 3. Daily Care Routine\n\n**Morning (Focus: Protection):**\n1.  **Cleanse:** Rinse with lukewarm water or a very gentle cleanser.\n2.  **Eye Cream:** Gently tap around the orbital bone.\n3.  **Moisturize:** Apply a lightweight gel-cream.\n4.  **Sunscreen:** Apply 2 finger-lengths to face and neck. **Re-apply every 2 hours** since you are outdoors.\n\n**Evening (Focus: Repair):**\n1.  **Double Cleanse:** Use a micellar water followed by your cleanser to remove outdoor pollutants and sunscreen.\n2.  **Hydrate:** Apply Hyaluronic Acid serum.\n3.  **Eye Cream:** Use a slightly thicker layer at night.\n4.  **Night Cream:** Use a slightly richer moisturizer on cheeks; keep it light on the T-zone.\n\n**Hair Care (Weekly):**\n*   **Wash Days (2-3 times/week):** Use cool water for the final rinse to seal the hair cuticle and reduce frizz.\n*   **Drying:** Do not rub with a towel. Use a **microfiber towel** or an old cotton T-shirt to \"scrunch\" out excess water.\n*   **Detangling:** Only detangle when hair is wet and coated in conditioner using a wide-tooth comb.\n\n---\n\n### 4. Ingredients to Avoid\n\n*   **Denatured Alcohol:** Found in many sunscreens and toners; it will exacerbate your moderate dryness and irritate your Level 4 sensitivity.\n*   **Physical Scrubs:** Avoid walnut shells or large beads. Your combination/sensitive skin will respond better to gentle chemical exfoliants (like PHAs) or a soft washcloth.\n*   **Sulfates (SLS/SLES):** These are the primary enemy of wavy, frizzy hair. They lift the hair cuticle, making frizz worse.\n*   **Heavy Silicones:** Avoid \"Dimethicone\" high up on the ingredient list of hair products, as it can weigh down waves and cause buildup, leading to more hair fall.\n\n---\n\n### 5. Lifestyle Tips\n\n*   **Outdoor Protection:** Since you are outdoors often, wear **UV-rated sunglasses**. This prevents \"squinting\" (which causes wrinkles) and protects the delicate under-eye skin from further darkening.\n*   **Friction Reduction:** Switch to a **silk or satin pillowcase**. This reduces friction on your wavy hair (preventing frizz) and is gentler on your sensitive skin.\n*   **Hydration & Diet:** Increase intake of Omega-3 fatty acids (walnuts, chia seeds, fish) to help with skin dryness and hair strength.\n*   **Hair Fall Management:** Avoid tight hairstyles (ponytails/buns) while outdoors. The tension, combined with outdoor movement, can increase hair shedding (traction). Use a silk scrunchie instead of rubber bands."}