{"user_id": 4, "recommendation": "This analysis is tailored to your unique profile: **Oily yet dehydrated (combination) dark skin** with pigmentation concerns, and **curly hair** with a dry, itchy scalp. A critical factor in your care is your **Coconut allergy**, as coconut derivatives (like Cocos Nucifera, Caprylic Triglyceride, and Coco-betaine) are staples in many \"natural\" and curly hair products.\n\n---\n\n### 1. Recommended Cosmetic Products\n\n**For Skin (Pigmentation & Acne):**\n*   **Cleanser:** A gentle, foaming **Salicylic Acid (BHA)** cleanser. This manages oil and acne without stripping moisture. *Recommendation: Ensure it is sulfate-free.*\n*   **Serum (Morning):** **Vitamin C (L-Ascorbic Acid)** or **Alpha Arbutin**. These are excellent for fading pigmentation on dark skin and providing antioxidant protection for your outdoor lifestyle.\n*   **Serum (Evening):** **Azelaic Acid (10%)**. This is a powerhouse for dark skin; it treats acne and targets hyperpigmentation simultaneously while being gentle on sensitive skin.\n*   **Moisturizer:** A lightweight, oil-free **Hyaluronic Acid** gel-cream. Since you have moderate dryness despite being oily, you need \"water-locking\" ingredients.\n*   **Sunscreen:** A **Mineral Sunscreen (Zinc Oxide/Titanium Dioxide)** with an SPF of 50+. Look for \"tinted\" versions to avoid the \"white cast\" often seen on dark skin.\n\n**For Hair (Curly & Dry Scalp):**\n*   **Shampoo:** A **Sulfate-free, Coconut-free** shampoo containing **Tea Tree Oil** or **Peppermint Oil** to address the scalp itch.\n*   **Conditioner:** Look for formulas based on **Shea Butter, Argan Oil, or Jojoba Oil**. Avoid any product listing \"Coconut milk\" or \"Caprylic/Capric Triglyceride.\"\n*   **Treatment:** **Bond-repairing treatments** (like those containing Bis-Aminopropyl Diglycol Dimaleate) to help with split ends and breakage.\n\n---\n\n### 2. Safe Home Remedies\n\n**For Skin:**\n*   **Honey & Turmeric Mask:** Mix raw honey (humectant) with a pinch of turmeric (anti-inflammatory). This brightens dark spots and kills acne bacteria. *Apply for 10 mins, twice a week.*\n*   **Aloe Vera Gel:** Use pure aloe vera (straight from the leaf to avoid coconut-derived preservatives) to soothe skin sensitivity and hydrate without adding oil.\n\n**For Hair:**\n*   **Apple Cider Vinegar (ACV) Rinse:** Mix 1 part ACV with 4 parts water. Pour over the scalp after shampooing to balance pH and eliminate itchiness. Rinse thoroughly.\n*   **Olive Oil Pre-Poo:** Apply slightly warm olive oil to the mid-lengths and ends of your hair 30 minutes before washing. This protects curly hair from \"hygral fatigue\" and reduces split ends.\n*   **Flaxseed Gel:** Boil flaxseeds in water to create a DIY styling gel. It is 100% coconut/gluten-free and provides great definition for curls.\n\n---\n\n### 3. Daily Care Routine\n\n**Morning (Focus: Protection):**\n1.  **Cleanse:** Wash with lukewarm water or a gentle BHA cleanser.\n2.  **Tone:** Use a Rose Water mist (ensure no alcohol).\n3.  **Treat:** Apply Vitamin C serum to damp skin.\n4.  **Hydrate:** Apply a lightweight oil-free moisturizer.\n5.  **Protect:** Apply SPF 50+ (Essential for preventing pigmentation from darkening outdoors).\n\n**Evening (Focus: Repair):**\n1.  **Double Cleanse:** Use a micellar water (check for coconut derivatives) followed by your BHA cleanser to remove outdoor pollutants.\n2.  **Treat:** Apply Azelaic Acid to acne and pigmented areas.\n3.  **Moisturize:** Use a slightly thicker, ceramide-rich cream to combat \"moderate dryness.\"\n\n**Hair Care (Weekly):**\n*   **Wash Day (1-2x a week):** Focus shampoo only on the scalp; focus conditioner only on the ends.\n*   **Detangle:** Only detangle while hair is soaking wet with conditioner using a wide-tooth comb.\n*   **Scalp Massage:** Spend 5 minutes daily massaging your scalp with dry fingers to stimulate blood flow and reduce hair fall.\n\n---\n\n### 4. Ingredients to Avoid\n\nGiven your allergies and skin type, scrutinize labels for these:\n*   **Coconut Derivatives:** *Cocos Nucifera, Caprylic/Capric Triglyceride, Sodium Cocoate, Coco-glucoside, Cocamidopropyl Betaine, Magnesium Cocoate.*\n*   **Gluten:** *Hydrolyzed Wheat Protein, Triticum Vulgare (Wheat) Germ Oil, Barley extract.* (Common in hair thickening products).\n*   **Dairy:** *Lactobacillus/Milk Ferment, Hydrolyzed Casein.*\n*   **Skin Irritants:** High concentrations of Denatured Alcohol (dries out oily skin, causing more oil production) and Synthetic Fragrances (triggers sensitivity).\n\n---\n\n### 5. Lifestyle Tips\n\n*   **Outdoor Protection:** Since you are outdoors often, wear a wide-brimmed hat. Dark skin is prone to \"stubborn\" pigmentation that worsens with heat, not just sunlight.\n*   **Friction Reduction:** Swap your cotton pillowcase for a **Satin or Silk pillowcase**. This prevents hair breakage (split ends) and stops the fabric from absorbing the moisture out of your skin.\n*   **Dietary Awareness:** Since you have Dairy and Gluten allergies, ensure you are getting enough **Biotin and Zinc** through seeds (pumpkin/sunflower) and leafy greens to help with hair fall.\n*   **Hydration:** \"Oily yet dry\" skin is often a sign of dehydration. Increase water intake to help the skin regulate oil production naturally.\n*   **Micro-Trims:** Visit a stylist every 8–10 weeks for a \"dusting\" (minimal trim) to stop split ends from traveling up the hair shaft."}